Repository: tiylabs/termio
Catalog: Sources/termio/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Turn off to disconnect your iPhone; pairing is kept.
zh_hans: 关闭后 iPhone 将断开连接；配对会保留。

source: Turned off in Settings ▸ Agents, so Termio removes it from %@.
zh_hans: 已在“设置 ▸ Agents”中关闭，因此 Termio 会把它从 %@ 上移除。

source: Turned off in Settings ▸ Agents, so Termio removes them from %@.
zh_hans: 已在“设置 ▸ Agents”中关闭，因此 Termio 会把它们从 %@ 上移除。

source: Type this code at github.com/login/device to approve Termio. Waiting for approval…
zh_hans: 在 github.com/login/device 输入此代码以授权 Termio。正在等待批准…

source: URL Pattern
zh_hans: URL 模式

source: Underline
zh_hans: 下划线

source: Ungroup
zh_hans: 取消编组

source: Unpin
zh_hans: 取消固定

source: Unsaved changes — press ⌘S to save to %@
zh_hans: 有未保存的更改 — 按 ⌘S 保存到 %@

source: Unsaved changes — saving…
zh_hans: 未存储的更改 — 正在存储…

source: Update
zh_hans: 更新

source: Update Anyway
zh_hans: 仍然更新

source: Update ready
zh_hans: 更新已就绪

source: Updated.
zh_hans: 已更新。

source: Usage
zh_hans: 用量

source: Usage statistics
zh_hans: 使用统计

source: Use Regular Expression
zh_hans: 使用正则表达式

source: Use Selection for Find
zh_hans: 用所选内容查找

source: Used for this invite only. To make it stick, start the daemon there with --wss-origin.
zh_hans: 仅用于本次邀请。要长期生效，请在那台机器上用 --wss-origin 启动守护进程。

source: User
zh_hans: 用户

source: Uses %@
zh_hans: 使用 %@

source: Version %@ on %@. Sessions keep running there after you disconnect.
zh_hans: %@ 上的版本 %@。断开连接后，会话仍在那里继续运行。

source: View
zh_hans: 显示

source: View on %@
zh_hans: 在 %@ 上查看

source: Waiting for the agent’s first status report.
zh_hans: 正在等待 Agent 的首次状态报告。

source: Wants a password
zh_hans: 需要密码

source: WeChat
zh_hans: 微信

source: WeChat group
zh_hans: 微信群

source: What Termio writes into each agent’s config on %@ so it can report. Reinstall after hand-editing one.
zh_hans: Termio 写入 %@ 上每个 Agent 配置里的内容，让它能回报状态。手工改过某个配置后请重新安装。

source: What the daemon said
zh_hans: 守护进程的原始输出

source: What this Mac runs, and what Termio installed on it
zh_hans: 这台 Mac 运行什么，以及 Termio 装了什么

source: What this workspace is called in the sidebar.
zh_hans: 这个工作区在侧栏中显示的名称。

source: When on, selecting text copies it straight to the clipboard.
zh_hans: 开启后，选中文本会直接拷贝到剪贴板。

source: Where each device launches %@ from. Leave empty to use its default.
zh_hans: 每台设备从哪里启动 %@。留空则使用其默认值。

source: Where each machine launches %@ from. Leave empty to use its default.
zh_hans: 每台设备从哪里启动 %@。留空则使用其默认值。

source: Where everything filed under this workspace lives.
zh_hans: 归入这个工作区的一切所在的位置。

source: Whether you want these at all, and putting them on every device.
zh_hans: 是否启用这些功能，以及把它们装到每台设备上。

source: Whether you want these at all, and putting them on this Mac.
zh_hans: 是否启用这些功能，以及把它们装到这台 Mac 上。

source: Whether you want these at all. Termio puts them on each machine as you set it up.
zh_hans: 是否启用这些功能。Termio 会在你设置每台设备时装上它们。

source: Which agent CLIs are on %@, where each launches from, and what Termio installed into their configs.
zh_hans: %@ 上有哪些 Agent 命令行工具、各自从哪里启动，以及 Termio 往它们的配置里装了什么。

source: Which machine your iPhone connects to. Each one serves its own sessions.
zh_hans: iPhone 连接到哪台机器。每台机器各自提供自己的会话。

source: Window
zh_hans: 窗口

source: Working Directory
zh_hans: 工作目录

source: Workspace
zh_hans: 工作区

source: Workspace Settings…
zh_hans: 工作区设置…

source: Workspace Unavailable
zh_hans: 工作区不可用

source: Workspaces
zh_hans: 工作区

source: Worktree has changes
zh_hans: Worktree 存在更改

source: Yesterday
zh_hans: 昨天

source: You can restore it from the Trash.
zh_hans: 可以从废纸篓恢复它。

source: Your Host entries from ~/.ssh/config — the same aliases `ssh` resolves. Right-click a host to connect.
zh_hans: 来自 ~/.ssh/config 的 Host 条目，与 `ssh` 解析的别名一致。右键点按主机即可连接。

source: Your themes
zh_hans: 你的主题

source: Zoom
zh_hans: 缩放

source: Zoom Split
zh_hans: 缩放拆分

source: `%@` is on your PATH. Run `%@ sessions …` to drive sibling sessions, or `%@ .` to open a folder.
zh_hans: `%@` 已在 PATH 中。运行 `%@ sessions …` 可驱动其他会话，运行 `%@ .` 可打开文件夹。

source: `termiod` on %@ isn’t answering.
zh_hans: %@ 上的 `termiod` 没有响应。

source: agents
zh_hans: 个 Agent

source: binary
zh_hans: 二进制

source: couldn’t install %@: %@
zh_hans: 无法安装 %1$@：%2$@

source: couldn’t launch %@: %@
zh_hans: 无法启动 %1$@：%2$@

source: current
zh_hans: 当前

source: devices
zh_hans: 台设备

source: e.g. JetBrains Mono
zh_hans: 例如 JetBrains Mono

source: first %1$lld of %2$lld files
zh_hans: %2$lld 个文件中的前 %1$lld 个

source: git couldn’t check “%@” for changes, so it was not removed.
zh_hans: git 无法检查“%@”是否有更改，因此未将其移除。

source: git couldn’t create a worktree for “%@”. Is it a git repository with at least one commit?
zh_hans: git 无法为“%@”创建 worktree。请确认它是包含至少一个提交的 git 仓库。

source: git couldn’t remove “%@”.
zh_hans: git 无法移除“%@”。

# issue.state.open
source: Open
zh_hans: 开放

source: macOS hasn’t been asked to allow Termio’s notifications yet.
zh_hans: macOS 尚未请求允许 Termio 发送通知。

source: machines
zh_hans: 台设备

source: nothing
zh_hans: 无

source: optional
zh_hans: 可选

source: optional — ~/.ssh/id_ed25519
zh_hans: 可选 — ~/.ssh/id_ed25519

source: set a command and URL pattern for the custom relay
zh_hans: 为自定义中继设置命令和 URL 模式

source: ssh unavailable
zh_hans: ssh 不可用

source: termio can teach the agents you run (Claude Code, Codex, …) a `termio sessions` command so they can see, drive, and read each other's sessions in a project. Enabling adds a short note to your ~/.claude/CLAUDE.md and installs status hooks. You can turn it off anytime in Settings ▸ Agents.
zh_hans: termio 可以教你运行的 Agent（Claude Code、Codex 等）使用 `termio sessions` 命令，让它们在项目中查看、驱动并读取彼此的会话。 启用后会在你的 ~/.claude/CLAUDE.md 中添加一段简短说明并安装状态 hooks。你可以随时在“设置 ▸ Agents”中将其关闭。

source: termiod on %@ never opened its listener. %@
zh_hans: %1$@ 上的 termiod 始终没有打开监听器。 %2$@

source: termiod on this Mac didn’t answer.
zh_hans: 这台 Mac 上的 termiod 没有响应。

source: termiod on this Mac is too old to search.
zh_hans: 这台 Mac 上的 termiod 版本过旧，不支持搜索。

source: this Mac
zh_hans: 本机

source: · resets %@
zh_hans: · 重置于 %@

source: “%@” already exists.
zh_hans: “%@”已存在。

source: “%@” is already in your config.
zh_hans: “%@”已存在于你的配置中。

source: “%@” isn’t a supported image.
zh_hans: “%@”不是受支持的图片。

source: “%@” isn’t installed — showing the system default.
zh_hans: “%@”未安装，正在显示系统默认字体。

source: Worktree is locked
zh_hans: Worktree 已锁定

source: Unlock “%@” (git worktree unlock) before removing it.
zh_hans: 请先解锁“%@”（git worktree unlock）再移除。

source: git still lists “%@”, so it was not removed.
zh_hans: git 仍列出“%@”，因此未移除。

source: git couldn’t read this project’s worktrees, so “%@” was not removed.
zh_hans: git 无法读取此项目的 worktree，因此未移除“%@”。

source: termio couldn’t read “%@”, so it was not removed.
zh_hans: termio 无法读取“%@”，因此未移除。

source: git can no longer inspect “%@”, and its folder still holds files. Delete the folder to remove the worktree.
zh_hans: git 已无法检查“%@”，且其文件夹中仍有文件。请删除该文件夹后再移除 worktree。

source: Something other than a folder is at “%@”. Move or delete it, then remove the worktree.
zh_hans: “%@”所在位置现在不是文件夹。请先移走或删除它，再移除 worktree。

source: termio couldn’t remove the empty folder at “%@”, so the worktree was not removed.
zh_hans: termio 无法删除“%@”处的空文件夹，因此未移除 worktree。

source: git no longer tracks “%@”, and its folder still holds files. Delete the folder to remove the worktree.
zh_hans: git 已不再跟踪“%@”，且其文件夹中仍有文件。请删除该文件夹后再移除 worktree。
